АлогистикТест2/src/Catalogs/алк_Простой/алк_Простой.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>алк_Простой</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>СтруктураПоГруппам</name>
      <description>Структура по группам</description>
    </items>
    <items>
      <name>СтруктураПоТипам</name>
      <description>Структура по типам</description>
    </items>
  </predefined>
  <attributes>
    <name>Цех</name>
    <type>
      <types>CatalogRef.алк_Цеха</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>МашинныйЦентр</name>
    <type>
      <types>CatalogRef.алк_МашинныйЦентр</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>CatalogRef.алк_ПодтипПростоя</types>
    </type>
  </attributes>
  <attributes>
    <name>Подтип1</name>
    <type>
      <types>CatalogRef.алк_ПодтипПростоя</types>
    </type>
  </attributes>
  <attributes>
    <name>Подтип2</name>
    <type>
      <types>CatalogRef.алк_ПодтипПростоя</types>
    </type>
  </attributes>
  <attributes>
    <name>Подтип25</name>
    <type>
      <types>CatalogRef.алк_ПодтипПростоя</types>
    </type>
  </attributes>
  <attributes>
    <name>Подтип3</name>
    <type>
      <types>CatalogRef.алк_ПодтипПростоя</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Узел</name>
    <type>
      <types>CatalogRef.алк_УзелУчастка</types>
    </type>
  </attributes>
  <attributes>
    <name>Служба</name>
    <type>
      <types>CatalogRef.алк_Службы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПростоя</name>
    <type>
      <types>CatalogRef.алк_ВидПростоя</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПростоя</name>
    <type>
      <types>CatalogRef.алк_ТипПростоя</types>
    </type>
  </attributes>
  <attributes>
    <name>IdleReasonID</name>
    <comment>Для обмена с Оптимониторингом</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

АлогистикТест2/src/Catalogs/алк_Простой/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	
	ДанныеГруппы = НайтиКорень(Объект, 0);
	
	Если ДанныеГруппы["Родитель"]= Справочники.алк_Простой.СтруктураПоГруппам Тогда  	
		Возврат;	
	КонецЕсли;  
	
	  
	Объект.Цех 				= Объект.Родитель.Цех;
	Объект.Участок 			= Объект.Родитель.Участок;
	Объект.МашинныйЦентр 	= Объект.Родитель.МашинныйЦентр;
	Объект.Тип 				= Объект.Родитель.Тип;
	Объект.Подтип1 			= Объект.Родитель.Подтип1;
	Объект.Подтип2 			= Объект.Родитель.Подтип2;
	Объект.Подтип25 		= Объект.Родитель.Подтип25;
	
	
КонецПроцедуры

&НаСервере
Функция НайтиКорень(Элем, УровеньГруппы)
	
	УровеньГруппы = УровеньГруппы + 1; 
	
	ДанныеГруппы = Новый Соответствие;
		
	Если НЕ ЗначениеЗаполнено(Элем.Родитель) Тогда 	
		
		ДанныеГруппы.Вставить("Родитель", Элем);
		ДанныеГруппы.Вставить("УровеньГруппы", УровеньГруппы);
		
        Возврат ДанныеГруппы;
		
	Иначе
		
		Возврат НайтиКорень(Элем.Родитель, УровеньГруппы);
		
	КонецЕсли; 
	
КонецФункции
